In [46]:
import pandas as pd

   EmpNr  FName LName
0      1   Adam  Hook
1      2    Bob     M
2      3  Chris     J
3      4    Dom     P

In [47]:
def EXECUTE_SQL(stmnt):
    stmnt=stmnt.lower()
    if "SELECT".lower() in stmnt:
        if "FROM".lower() in stmnt:
            table_name = stmnt.split(" ")[3]
            if(table_name == 'emp'):
                df = pd.read_csv("emp.csv")
                return df            
        else:
            print("Not a valid statement!")
    else:
        return "Not a valid statement!"

In [48]:
EXECUTE_SQL("SELECT * FROM EMP")

   EmpNr  FName LName
0      1   Adam  Hook
1      2    Bob     M
2      3  Chris     J
3      4    Dom     P